h = {a: 1, b: [2, [3]], d: 4}
h.flatten                       # => [:a, 1, :b, [2, [3]], :d, 4]
# 1だと同じ操作
h.flatten(1)                    # => [:a, 1, :b, [2, [3]], :d, 4]
# 0だと 配列の配列に
h.flatten(0)                    # => [[:a, 1], [:b, [2, [3]]], [:d, 4]]
h.flatten(2)                    # => [:a, 1, :b, 2, [3], :d, 4]

h.flatten(-1)                   # => [:a, 1, :b, 2, 3, :d, 4]
h.flatten.flatten               # => [:a, 1, :b, 2, 3, :d, 4]

h = {a: 1, b: {c: 2}, d: 3}
# ハッシュが残る
h.flatten(-1)                   # => [:a, 1, :b, {:c=>2}, :d, 3]
